import type { BaseTranslation } from '../i18n-types';

const en: BaseTranslation = {
	title: 'فن المعمار',
	veryTopNav: {
		mobile: '+966 59 737 0785 :الريــاض',
		jed: '+966 58 025 1227 :جــدة',
		email: 'info@buildingtec.com'
	},
	mainNav: {
		home: 'الرئيسية',
		products: 'المنتجات',
		about: 'عن الشركة',
		cabins: 'كبائن',
		projects: 'مشاريع',
		brands: 'موديلات',
		media: 'الوسائط',
		career: 'وظائف',
		blog: 'المدونة',
		quote: 'عرض سعر'
	},
	modernDesign: 'تصميمات حديثة',
	greatIdeas: 'أفكار رائعة',
	powerfulManagement: 'إدارة ماهرة',
	modernDesignParagraph:
		'تصاميمنا رائعة وجميلة وتمتاز بخطوط واضحة ولوحة ألوان بسيطة تتناسب مع جميع الأذواق.',
	greatIdeasParagraph:
		'لدينا حلول تناسب كل الأذواق، بناءً على تجربتنا، سوف نقدم أكثر من فكرة لتلبية احتياجاتك.',
	powerfulManagementParagraph:
		'فريقنا مدرب تدريباً عالياً ولديه الخبرات اللازمة لتخطيط وإدارة وتسليم مشروعك في الوقت المحدد.',
	welcomeSection: {
		heading: 'مرحباً في',
		headingSpan: 'فن المعمار للمصاعد',
		firstTitle: 'أسهل طرق التركيب',
		firstParagraph:
			'سواء كان المصعد لشركتك أو لبيتك، وسواء أردت تركيب بئر للمصعد أو لا، نستطيع تلبية كل طلباتك بأسهل الطرق.',
		secondTitle: 'جودة أوروبية',
		secondParagraph: 'باتباع أفضل إجراءات السلامة، نقدم أسرع الخدمات وأكثرها موثوقية.',
		thirdTitle: 'أسعار منافسة',
		thirdParagraph: 'يمكننا تقديم خدمات عالية الجودة مع الحفاظ على أسعارنا التنافسية.'
	},
	productsSection: {
		heading: 'معرض المنتجات'
	},
	dopplerSection: {
		heading: 'دوبلر العالمية',
		headingSpan: 'الوكيل الحصري لشركة',
		p1: 'تتمكن شركة فن المعمار للمصاعد، ومن خلال تعاونها مع شركة دوبلر من تقديم مجموعة كاملة من الإختيارات والتطبيقات لتوفير كافة الإحتياجات في مجال النقل العمودي.',
		p2: 'عندما يتعلق الأمر بالمصاعد ، فإن كل ثانية مهمة. تحقق شركة فن المعمار أعلى التوقعات من خلال إستخدام أحدث التقنيات في هذا المجال.',
		p3: 'تعتبر مصاعد شركة فن المعمار هي الاختيار الأمثل للاحتياجات الملحة لأي منشأة.',
		p4: 'تعتبر حالات الطوارئ وحركة المرور المستمرة للأشخاص والأطباء والممرضات وزوار الفنادق والأشخاص المهمين في المكاتب الفاخرة ونقل الأسرة الضخمة والكراسي المتحركة والمعدات الطبية والسيارات والسلع تحديات يومية تتطلب حلولًا موثوقة وقوية.',
		p5: 'توفر مصاعدنا أمانًا عاليًا وراحة كبيرة وقيادة ممتازة وخفضًا للتكلفة من خلال أنظمة توفير الطاقة والتي تعمل جنباً إلى جنب مع التصميم الحديث.'
	},
	servicesSection: {
		heading: 'خدمات الشركة',
		installationTitle: 'خدمة التركيب',
		installationText:
			'تقوم شركة فن المعمار للمصاعد باتباع إجراءات صارمة أثناء تقديم خدمات التركيب وتحت إشراف مهندسين متخصصين، وذلك لحرصها الدائم على تقديم الخدمة الأسرع والأكثر موثوقية داخل المملكة العربية السعودية.',
		trafficTitle: 'تحليل الحركة',
		trafficTextP1: 'تحليل حركة الأشخاص داخل المبنى بإستخدام أدق طرق التحليل المتوفرة.',
		trafficTextP2:
			'يمكن لشركتنا تزويد جميع المهندسين الاستشاريين بتحليل مجاني لحركة المصاعد داخل المبنى من أجل تحديد السرعة والسعة المثلى للمصاعد الخاصة بهم.',
		maintenanceTitle: 'الصيانة الدورية',
		maintenanceS1Title: 'صيانة مخطط لها مسبقا',
		maintenanceS1Text: 'تمنحك صيانتنا الوقائية راحت البال حيث تضمن استمرار عمل مصعدك بشكل دائم.',
		maintenanceS2Title: 'الإصلاحات',
		maintenanceS2Text:
			'إذا تعطل المصعد الخاص بك ، فإن أولويتنا هي إصلاحه. اتفاقية الخدمة الخاصة بك هي ضمانك بأن تحصل على خدمة إصلاح ذات أولوية من المهندسين ذوي الخبرة والدراية بمصعدك.',
		maintenanceS3Title: 'الضمان',
		maintenanceS3TextP1: 'تقدم شركتنا ضمانًا لمدة عامين (2) لجميع المعدات.',
		maintenanceS3TextP2:
			'طاقمنا الفني على أهبة الاستعداد لخدمتكم 24 ساعة / 7 أيام في الأسبوع لإصلاح الأعطال فوراً، وتقديم أفضل خدمة ممكنة.'
	},
	quoteRequest: {
		title: 'طلب عرض سعر',
		newElevator: 'مصعد جديد',
		newMaintenanceContract: 'عقد صيانة'
	},
	projects: {
		title: 'أعمالـنا السابقة',
		more: 'المـزيد ...'
	},
	aboutUs: {
		title: 'من نحن',
		ourStory: {
			title: 'قصة نجـاحنــا',
			p1: 'تعد BuildingTec Elevators الرائدة في مجال حلول المصاعد، حيث تعمل باستمرار نحو تحقيق رؤيتها في أن تصبح الرائدة الأولى في دول مجلس التعاون الخليجي. لقد بنينا علاقات قوية وقاعدة عملاء مثيرة للإعجاب في الخليج، ونقوم أيضا ببناء العلاقات في الخارج لتكوين شراكات متبادلة الفائدة تساهم في رفع مكانة المملكة العربية السعودية بشكل أكبر كبلد في طليعة النمو التكنولوجي. هدفنا الموحد للنجاح وشغفنا للكمال يعكس داخليا وخارجيا.',
			p2: 'لقد زرعنا ثقافة داخلية تركز دائمًا على الاهتمام الدقيق بالتفاصيل الدقيقة وضمان خدماتنا التي لا تشمل فقط تقديم منتج ذو جودة، ولكن أيضا التعليم على طول الطريق. وقد أدى هذا إلى شهرتنا بتقديم ما يتجاوز توقعات العملاء. من خلال نهجنا العملي، وخبرتنا، وتنفيذنا المنهجي، وتسليم المشاريع في الوقت المحدد، لقد اكتسبنا الثقة وبنينا علاقة جيدة داخل مجتمعنا التي في النهاية جعلتنا متميزين عن منافسينا. من خلال تفانينا في تقديم الحلول لمجتمعنا، قمنا ببناء علاقات قوية وأنشأنا بيئة آمنة ومستدامة ومريحة لمجتمعنا للنمو فيها.',
			p3: 'من خلال ممارسة "التحفيز الذاتي" داخليا، تمكنا أيضاً من تعزيز ثقافة النمو. يتم تقديم الفرصة لموظفينا بمثابة منحنى تعليمي يتيح للجميع الانخراط في جانب الأعمال التجارية للشركة أيضا. من خلال هذا، تمكنا من توسيع عملياتنا وأصبحنا مساهماً بارزاً في رؤية المملكة العربية السعودية 2030.',
			p4: 'نحن أيضا نقدم منصة للمواهب المحلية لتصبح أعضاء رئيسيين في فريقنا، تحت إشراف الخبراء الذين تم توجيههم لرفع المعايير داخليا، لتقديم التميز الذي لا يقبل التنازلات خارجيا. بفضل نهجنا الصريح والمباشر، والتزامنا بتقديم تجربة ومنتج ذو جودة، أصبحت BuildingTec Elevators الآن واحدة من أكثر الشركات التي يتم السعي إليها في الصناعة.'
		},
		ourValues: {
			title: 'قيمنا',
			v1: 'الجودة',
			p1: 'الجودة من أهم المعايير التي نحافظ عليها في كل خطوة من خطوات عملنا.',
			v2: 'المرونة',
			p2: 'نحقق ذلك من خلال تعديل آلية الشركة حسب احتياجات العميل.',
			v3: 'المصداقية',
			p3: 'سنصل إلى الهدف بناء على خبرتنا.',
			v4: 'الإستقرار',
			p4: 'يشعر عملاؤنا بالأمان من خلال إجراءات عملنا المستقرة.',
			v5: 'الدعم',
			p5: 'نحن ندعم عملائنا في كل خطوة من خطوات المشروع.',
			v6: 'الإبتكار',
			p6: 'الخبرة والابتكار واحدة من أهم سماتنا.'
		},
		whyUs: {
			title: 'لماذا تختــارنا',
			r1: 'حلول المصاعد المتكاملة من التصميم إلى التشغيل النهائي وما بعد البيع.',
			r2: 'تصميم وتصنيع حسب مواصفات العملاء واحتياجاتهم.',
			r3: 'دعم فني لتركيب وخدمة المنتجات من خلال مركز الاتصال الخاص بنا على مدار 24 ساعة / 7 أيام.',
			r4: 'توفر قطع الغيار لجميع دورة حياة المنتج وتوصيلها وتركيبها دون عناء.'
		}
	},
	footer: {
		contact: {
			title: 'اتصــل بنا',
			email: 'البريد الإلكتروني: info@buildingtec.com',
			riyadhMobile: 'الريــاض: 00966597370785',
			jeddahMobile: 'جــدة: 00966580251227',
			hotLine: 'الخط الساخن: 920023588',
			locations: 'فــروعنا:',
			city1: 'الــريـاض',
			city2: 'جــدة',
			riyadhLocation: 'طريق عثمان بن عفان الفرعي، الرياض.',
			jeddahLocation: 'جدة - شارع آبي هيثم الأنصاري - حي المحمدية.'
		},
		message: {
			title: 'راســلنا',
			form: {
				fullName: 'الإسم:',
				fullNameError: 'الإسم يجب أن يكون أكثر من ثلاثة أحرف!',
				fullNameLengthError: 'الحد الأقصى للإسم 60 حرف!',
				fullNameNumericError: 'غير مسموح بالأرقام!',
				fullNamePlaceholder: 'أدخل اسمك هنا ...',
				email: 'البريد الإلكتروني:',
				emailError: 'من فضلك أدخل ايميل صحيح!',
				emailPlaceholder: 'أدخل عنوان البريد الإلكتروني ... (إختياري)',
				mobileNumber: 'رقم الجوال:',
				mobilePlaceholder: 'أدخل رقم الجوال ...',
				mobileError: 'من فضلك أدخل رقم جوال صحيح!',
				textArea: 'الرسالة:',
				textAreaPlaceholder: 'أكتب رسالتك هنا ...',
				textAreaError1: 'رسالتك قصيرة للغاية!',
				textAreaError2: 'الحد الأقصى للرسالة 500 حرف!',
				submit: 'إرســـال',
				successFeedback: 'أرسلت بنجاح!',
				errorFeedback: 'حدث خطأ ما!',
				notAllowedFeedback: 'من فضلك، نحتاج رقم جوال أو بريد الكتروني على الأقل!'
			}
		}
	}
};

export default en;
