import type { BaseTranslation } from '../i18n-types';

const en: BaseTranslation = {
	title: 'فن المعمار',
	veryTopNav: {
		mobile: '+966 59 737 0785 :الريــاض',
		jed: '+966 58 025 1227 :جــدة',
		email: 'info@buildingtec.com'
	},
	modernDesign: 'تصميمات حديثة',
	greatIdeas: 'أفكار رائعة',
	powerfulManagement: 'إدارة ماهرة',
	modernDesignParagraph:
		'تصاميمنا رائعة وجميلة وتمتاز بخطوط واضحة ولوحة ألوان بسيطة تتناسب مع جميع الأذواق.',
	greatIdeasParagraph:
		'لدينا حلول تناسب كل الأذواق، بناءً على تجربتنا، سوف نقدم أكثر من فكرة لتلبية احتياجاتك.',
	powerfulManagementParagraph:
		'فريقنا مدرب تدريباً عالياً ولديه الخبرات اللازمة لتخطيط وإدارة وتسليم مشروعك في الوقت المحدد.',
	welcomeSection: {
		heading: 'مرحباً في',
		headingSpan: 'فن المعمار للمصاعد',
		firstTitle: 'أسهل طرق التركيب',
		firstParagraph:
			'سواء كان المصعد لشركتك أو لبيتك، وسواء أردت تركيب بئر للمصعد أو لا، نستطيع تلبية كل طلباتك بأسهل الطرق.',
		secondTitle: 'جودة أوروبية',
		secondParagraph: 'باتباع أفضل إجراءات السلامة، نقدم أسرع الخدمات وأكثرها موثوقية.',
		thirdTitle: 'أسعار منافسة',
		thirdParagraph: 'يمكننا تقديم خدمات عالية الجودة مع الحفاظ على أسعارنا التنافسية.'
	},
	productsSection: {
		heading: 'معرض المنتجات'
	},
	dopplerSection: {
		heading: 'دوبلر العالمية',
		headingSpan: 'الوكيل الحصري لشركة',
		p1: 'تتمكن شركة فن المعمار للمصاعد، ومن خلال تعاونها مع شركة دوبلر من تقديم مجموعة كاملة من الإختيارات والتطبيقات لتوفير كافة الإحتياجات في مجال النقل العمودي.',
		p2: 'عندما يتعلق الأمر بالمصاعد ، فإن كل ثانية مهمة. تحقق شركة فن المعمار أعلى التوقعات من خلال إستخدام أحدث التقنيات في هذا المجال.',
		p3: 'تعتبر مصاعد شركة فن المعمار هي الاختيار الأمثل للاحتياجات الملحة لأي منشأة.',
		p4: 'تعتبر حالات الطوارئ وحركة المرور المستمرة للأشخاص والأطباء والممرضات وزوار الفنادق والأشخاص المهمين في المكاتب الفاخرة ونقل الأسرة الضخمة والكراسي المتحركة والمعدات الطبية والسيارات والسلع تحديات يومية تتطلب حلولًا موثوقة وقوية.',
		p5: 'توفر مصاعدنا أمانًا عاليًا وراحة كبيرة وقيادة ممتازة وخفضًا للتكلفة من خلال أنظمة توفير الطاقة والتي تعمل جنباً إلى جنب مع التصميم الحديث.'
	}
};

export default en;
